Revit 2027 API
SpecTypeId.PipingViscosity Property
 Dynamic Viscosity, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingViscosity { get; }
Public Shared ReadOnly Property PipingViscosity As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingViscosity {
	ForgeTypeId^ get ();
}
static member PipingViscosity : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace